tutorials/minimalSurfaceFoam/plane/Allrun
#!/bin/bash

blockMesh

transformPoints "translate=(-0.05 -0.05 0)"

minimalSurfaceFoam
